app/controllers/messages_controller.rb

  def index
    @messages = Message.paginate(:page => params[:page], :per_page => 50)
---
SELECT * FROM "messages" LIMIT 50 OFFSET 0

  def show
    sender    = Client.find_by_handle(params[:id])
    @messages = Message.for_sender(sender).paginate(:page => params[:page], :per_page => 50)
---
SELECT * FROM "clients" WHERE ("clients"."handle" = 'maccman') LIMIT 1
SELECT * FROM "messages" WHERE ("messages"."sender_id" = 1) LIMIT 50 OFFSET 0