app/controllers/users_controller.rb

INSERT INTO "users" ("name", "salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('', '26f63509f666c79e9c9d6d02046432e2f6db4086', '2009-02-06 16:04:50', 'd5265eaea5e77c8175becf93426e9cffceced00e', NULL, NULL, 'maccman', 'maccman@gmail.com', '2009-02-06 16:04:50')
SELECT * FROM "users" LIMIT 1
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
    if success && @user.errors.empty?